In [2]:
import pandas as pd
import numpy as np

In [4]:
# To create the DataFrame using dictionary.
d1 = {'Name':['Aadyan','Nethra','sunny'],
      'Rno':[423,510,235],
       'Branch':['Cse','Ece','Eee']}
df = pd.DataFrame(d1)
df

     Name  Rno Branch
0  Aadyan  423    Cse
1  Nethra  510    Ece
2   sunny  235    Eee

In [5]:
# using shape we get the number of rows and columns.
df.shape

(3, 3)

In [6]:
# To get the columns names.. using .columns
df.columns

Index(['Name', 'Rno', 'Branch'], dtype='object')

In [7]:
# To get the row data using .values
df.values

array([['Aadyan', 423, 'Cse'],
       ['Nethra', 510, 'Ece'],
       ['sunny', 235, 'Eee']], dtype=object)

### Pandas Indexing:
- To get the data from a DataFrame using row indexing and column names.

In [8]:
df

     Name  Rno Branch
0  Aadyan  423    Cse
1  Nethra  510    Ece
2   sunny  235    Eee

In [9]:
# To print the specific column name data ...
# To print only the names from a dataframe..
df['Name']

0    Aadyan
1    Nethra
2     sunny
Name: Name, dtype: object

In [12]:
# To print the dataframe with different columns..
# TO print the only rollnumber along with branch..
#df.columns
df[['Rno','Branch']]

   Rno Branch
0  423    Cse
1  510    Ece
2  235    Eee

In [15]:
# To print the first five records using head() method...
df.head()
# df.head(2)
df.head(1)

     Name  Rno Branch
0  Aadyan  423    Cse

In [19]:
# To print the last five records using tail() method.
df.tail()

     Name  Rno Branch
0  Aadyan  423    Cse
1  Nethra  510    Ece
2   sunny  235    Eee

In [18]:
df.tail(1) # To get the last record

    Name  Rno Branch
2  sunny  235    Eee

In [28]:
# TO print the specific value...
# iloc: integer location iloc[rowindex_value,columnindex_value]
df.iloc[1,1]

510

In [30]:
df.Rno[1]

510

In [35]:
# TO print the total row of a specific rollnumber record..
df.iloc[1]
df.iloc[[1]]

     Name  Rno Branch
1  Nethra  510    Ece

In [36]:
# using loc[colunames]
df.loc[(df['Rno']==423)]

     Name  Rno Branch
0  Aadyan  423    Cse

In [39]:
# To add the new record to dataframe..
df.loc[3]=['Krishna',235,'Eee']
df

      Name  Rno Branch
0   Aadyan  423    Cse
1   Nethra  510    Ece
2    sunny  235    Eee
3  Krishna  235    Eee

In [43]:
# to add the new to data to dataframe
df.loc[len(df.index)]=['aaryan',510,'Cse']
df

      Name  Rno Branch
0   Aadyan  423    Cse
1   Nethra  510    Ece
2    sunny  235    Eee
3  Krishna  235    Eee
4   aaryan  510    Cse
5   aaryan  510    Cse

In [44]:
len(df.index)

6

In [51]:
# using append() method we can add the new record..
df = df.append(['narmada',456,'ECE'],ignore_index=True)
df.drop(0,axis=1,inplace=True)

In [54]:
df.dropna()
df

   Branch     Name    Rno
0     Cse    ashok  510.0
1     Ece   Nethra  510.0
2     Eee    sunny  235.0
3     Eee  Krishna  235.0
4     Cse   aaryan  510.0
5     Cse   aaryan  510.0
6     NaN      NaN    NaN
7     NaN      NaN    NaN
8     NaN      NaN    NaN
9     NaN      NaN    NaN
10    NaN      NaN    NaN
11    NaN      NaN    NaN
12    NaN      NaN    NaN
13    NaN      NaN    NaN
14    NaN      NaN    NaN

In [55]:
df = df.dropna()
df

  Branch     Name    Rno
0    Cse    ashok  510.0
1    Ece   Nethra  510.0
2    Eee    sunny  235.0
3    Eee  Krishna  235.0
4    Cse   aaryan  510.0
5    Cse   aaryan  510.0

In [56]:
df

  Branch     Name    Rno
0    Cse    ashok  510.0
1    Ece   Nethra  510.0
2    Eee    sunny  235.0
3    Eee  Krishna  235.0
4    Cse   aaryan  510.0
5    Cse   aaryan  510.0

In [58]:
# To add the new column data..
df['Course']=['java','python','data Analysis','c','c++','oops']
df

<ipython-input-58-188b15bf8319>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Course']=['java','python','data Analysis','c','c++','oops']

  Branch     Name    Rno         Course
0    Cse    ashok  510.0           java
1    Ece   Nethra  510.0         python
2    Eee    sunny  235.0  data Analysis
3    Eee  Krishna  235.0              c
4    Cse   aaryan  510.0            c++
5    Cse   aaryan  510.0           oops

In [59]:
df

  Branch     Name    Rno         Course
0    Cse    ashok  510.0           java
1    Ece   Nethra  510.0         python
2    Eee    sunny  235.0  data Analysis
3    Eee  Krishna  235.0              c
4    Cse   aaryan  510.0            c++
5    Cse   aaryan  510.0           oops

In [62]:
# To update the new value..
df.iloc[1,0]='CSE'
df

C:\Users\Bhavya\anaconda3\lib\site-packages\pandas\core\indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

  Branch     Name    Rno         Course    0
0    Cse    ashok  510.0           java  NaN
1    CSE   Nethra  510.0         python  CSE
2    Eee    sunny  235.0  data Analysis  NaN
3    Eee  Krishna  235.0              c  NaN
4    Cse   aaryan  510.0            c++  NaN
5    Cse   aaryan  510.0           oops  NaN

In [63]:
df

  Branch     Name    Rno         Course    0
0    Cse    ashok  510.0           java  NaN
1    CSE   Nethra  510.0         python  CSE
2    Eee    sunny  235.0  data Analysis  NaN
3    Eee  Krishna  235.0              c  NaN
4    Cse   aaryan  510.0            c++  NaN
5    Cse   aaryan  510.0           oops  NaN

In [65]:
# To delete the data from a DataFrame...
# using drop() method..
# here -> axis=0  -> row wise deletion
# axis=1 -> column wise deletion
df

  Branch     Name    Rno         Course    0
0    Cse    ashok  510.0           java  NaN
1    CSE   Nethra  510.0         python  CSE
2    Eee    sunny  235.0  data Analysis  NaN
3    Eee  Krishna  235.0              c  NaN
4    Cse   aaryan  510.0            c++  NaN
5    Cse   aaryan  510.0           oops  NaN

In [66]:
# To delete the first row record?
df.drop(1,axis=0,inplace=True)
df

C:\Users\Bhavya\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

  Branch     Name    Rno         Course    0
0    Cse    ashok  510.0           java  NaN
2    Eee    sunny  235.0  data Analysis  NaN
3    Eee  Krishna  235.0              c  NaN
4    Cse   aaryan  510.0            c++  NaN
5    Cse   aaryan  510.0           oops  NaN

In [68]:
# TO delete the specific column record..
df.drop('Course',axis=1,inplace=True)
df

C:\Users\Bhavya\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

  Branch     Name    Rno    0
0    Cse    ashok  510.0  NaN
2    Eee    sunny  235.0  NaN
3    Eee  Krishna  235.0  NaN
4    Cse   aaryan  510.0  NaN
5    Cse   aaryan  510.0  NaN

In [69]:
df.drop(0,axis=1,inplace=True)
df

C:\Users\Bhavya\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

  Branch     Name    Rno
0    Cse    ashok  510.0
2    Eee    sunny  235.0
3    Eee  Krishna  235.0
4    Cse   aaryan  510.0
5    Cse   aaryan  510.0

In [72]:
# To rename the column names
df

  Branch     Name    Rno
0    Cse    ashok  510.0
2    Eee    sunny  235.0
3    Eee  Krishna  235.0
4    Cse   aaryan  510.0
5    Cse   aaryan  510.0

In [73]:
# To rename the single column name using rename() method.
df.rename(columns={'Rno':'Rollnumber'},inplace=True)
df

C:\Users\Bhavya\anaconda3\lib\site-packages\pandas\core\frame.py:4441: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

  Branch     Name  Rollnumber
0    Cse    ashok       510.0
2    Eee    sunny       235.0
3    Eee  Krishna       235.0
4    Cse   aaryan       510.0
5    Cse   aaryan       510.0